refactor: application and library grouping (#410)
